"" + 1 + 0 //  "10" /////////////right
"" - 1 + 0 // 0 -1 + 0 = -1 /////right
true + false // 1 - число ///////right
6 / "3" // 6 / 3 = 2 ////////////right
"2" * "3" // 6 //////////////////right
4 + 5 + "px" // "45px"///////////wrong => сначала выполняется (4+5), а потом это конкатенируется с "px"
"$" + 4 + 5 // "$45"/////////////right

"4" - 2 // 4 -2 = 2 /////////////right

"4px" - 2 // NaN ////////////////right

7 / 0 // Infinity ///////////////right

"  -9\n" + 5 // "  -9\n5" ///////right
"  -9\n" - 5 // -9 - 5 = -14/////right
5 && 2 // 2 /////////////////////right

2 && 5 // 5 /////////////////////right

5 || 0 // 5 /////////////////////right (короткий цикл)

0 || 5 // 0 /////////////////////wrong => 5 (выбирается самый лучший, всё-таки дизъюнкция :) )
null + 1 // 0 + 1 = 1 ///////////right
undefined + 1 //NaN   ///////////right
null == "\n0\n" // 0 == 0 =>true
///wrong => false (при сравнении == с null преобразования не происходит, есть жёсткое правило: null == undefined и только)
+null == +"\n0\n" // 0 == 0 => true ////right (преобразования к числу слева и справа)